{"pageProps":{"postData":{"id":"welcome_to_the_nether","contentHtml":"<p><a href=\"https://www.minecraft.net/fi-fi/article/nether-update-java\">The Nether Update</a> on saapunut myös Karanteeniin! TL;DR löytynee postauksen lopusta.</p>\n<p>Nether Update on Karanteenin suurin pelikokemusta muuttava päivitys. 1.16.2 version pyöriessä palvelimella, mietimme samalla palvelintamme. Kysyimme teiltä 3. kesäkuuta 2020, millä tavoin voimme parantaa teidän pelikokemustanne ja olemme jo saaneet suunnitelmaa tähän. Nether Update teki joitain asioita helpoksi meidän kantiltamme. Löimme lukkoon 29. kesäkuuta, että nollaamme Netherin tästedes viimeisen kerran hetkeen. Samalla End nollautuu vain kerran kartan aikana, suunnilleen puolessa välissä puolen vuoden aikataulua.</p>\n<p>Kuten varmasti huomaatte, nettisivuja on mukautettu <strong>huomattavasti</strong>. Nettisivujen tiettyjä elementtejä on \"modernisoitu\" ja tehty selkeämmäksi. Samalla nettisivut saivat hornan tulisen ulkoasun juhlistaaksemme Nether Updatea. Ylläpitokortit saivat uuden ulkoasun, jossa nyt lyhyesti selitetty myös ylläpitäjien vahvuudet. Navigaatiopalkki sai itselleen napit ja alasvetovalikkoihin animaatiot. Footeria laajennettiin ja sisältää varmasti kauan kaivatut sosiaalisen median linkit. Sen lisäksi sieltä pääsee helposti navigoimaan seuraavaan paikkaan, mikäli kokee tarpeelliseksi. Työtä nettisivujen kanssa on kuitenkin vielä paljon, sillä selkeä ulkoasu ja käyttökokemus ovat hyviä ominaisuuksia.</p>\n<p><strong>Miksi tässä päivityksessä kesti näin kauan?</strong> Ajan puute, 1.16.2 version odottaminen, plugineiden päivittäminen, odottamattomat ongelmat... Man, life is unpredictable at times.</p>\n<p><strong>TL;DR:</strong></p>\n<ul>\n<li>Palvelimella pyörii Paper 1.16.2</li>\n<li>End ja Nether nollattu, End nollataan jatkossa vain kerran per kartta</li>\n<li>Nettisivua \"modernisoitu\", mutta sitä jatketaan + Nether teema</li>\n</ul>\n<p>Terveisiä Crimson Forestista, Netheristä.\nKaranteenin ylläpito</p>\n","title":"Welcome to the Nether! ","date":"2020-08-20","modified":"2020-09.2020","type":"Päivitys"},"otherPosts":[{"id":"caves_and_cliffs","title":"Caves & Cliffs","date":"2021-07-13","type":"Ilmoitus"},{"id":"1.17","title":"1.17.1","date":"2021-07-11","type":"Ilmoitus"},{"id":"kesa_lahestyy_2021","title":"Kesä lähestyy","date":"2021-05-10","type":"Ilmoitus"},{"id":"paasiainen_2021","title":"Pääsiäinen","date":"2021-03-31","type":"Ilmoitus"},{"id":"moderni_maailma","title":"Moderni maailma","date":"2021-03-21","type":"Ilmoitus"},{"id":"teemapaiva","title":"Teemapäivä","date":"2020-12-05","type":"Päivitys"}]},"__N_SSG":true}