{"pageProps":{"postData":{"id":"joulun_ja_korjausten_nakymat","contentHtml":"<p>Pyrimme parhaamme mukaan selättämään jo aikansa palvelinta kiusanneet 1.14 version mukana saapuneet ongelmat, ja kiitämme teitä kärsivällisyydestä. Puhutaan nyt kuitenkin jostain mukavammasta, nimittäin joulusta.</p>\n<p>Karanteenin joulukuu tulee olemaan varsin kiireellistä aikaa koko Karanteenin väelle elottomasta ylläpitoon. Joulukuulta voi odottaa päivityksiä palvelimen toimintaan liittyen (komentojen, pluginien korjauksia yms.), mutta ehkä mielenkiintoisempaa on huomauttaa, että parannusten ohella on saapumassa monia jouluisia tapahtumia.</p>\n<p>Joulukuussa Karanteeniin aukeaa joulukalenteri, minkä ansiosta joulu tulee olemaan varsin tapahtumakeskeinen. Suosittelemme pitämään silmällä tätä sivua sekä Discordin ilmoitukset ja tapahtumat -kanavia, sillä luvassa on varsin hauskoja ja mielenkiintoisia yllätyksiä.</p>\n<p>Huomioitavaa myös on, että täällä netissä pyritään korjaamaan vanhentuneet tiedot voimassaoleviksi. Pitkälti kaikki paikkaansa pitämätön tieto on jo karsittu pois, mutta mikäli silmään kuitenkin vielä kantautuu väärää tai vanhentunutta tietoa, pyydämme ilmoittamaan siitä ylläpidolle.</p>\n<p><strong>TLDR;</strong> Joulukuussa Karanteenissa on kaksi päälimmäistä agendaa: palvelimen pintaremontointi ja tapahtumakeskeinen joulun odotus.</p>\n<p>Ystävällisin terveisin,\nKaranteenin ylläpito</p>\n","title":"Joulun ja korjausten näkymät","date":"2019-09-20","type":"Ilmoitus"},"otherPosts":[{"id":"moderni_maailma","title":"Moderni maailma","date":"2021-03-21","type":"Ilmoitus"},{"id":"teemapaiva","title":"Teemapäivä","date":"2020-12-05","type":"Päivitys"},{"id":"kirahvinpaa","title":"Kirahvinpää","date":"2020-11-07","type":"Päivitys"},{"id":"1.16.3","title":"1.16.3","date":"2020-09-11","type":"Ilmoitus"},{"id":"welcome_to_the_nether","title":"Welcome to the Nether! ","date":"2020-08-20","modified":"2020-09.2020","type":"Päivitys"},{"id":"karanteeni_ja_uusi_palvelin","title":"Karanteeni ja uusi palvelin","date":"2020-04-22","type":"Ilmoitus"}]},"__N_SSG":true}