{"pageProps":{"postData":{"id":"villages_and_pillages","contentHtml":"<p>Kauan odotettu 1.14 päivitys Karanteeniin on saapunut!</p>\n<p><strong>TLDR;</strong> vaihdoimme palveluntarjoajaa ja otimme käyttöön BungeeCordin (Spigot 1.14.4). Palvelimella esiintyy bugeja, eikä kaikkia ominaisuuksia ole vielä lisätty, mutta saapuvat ajan kanssa.</p>\n<p><strong><em>HUOM!</em></strong> Tiedämme, että serverillä on lagia (johtuen 1.14.4), sitä ei tarvitse kertoa.</p>\n<p>Päivitys tuo tullessaan BungeeCordin, uuden IP-osoitteen, uutta palvelinrautaa (jotta serveri pysyisi pelaamiskelpoisena), uudet pluginit ja huomattavasti vähemmän bugeja. Karanteeni aloittaa toimintansa aluksi pelkästään Survival pelimuodolla PvP:n jäädessä tauolle. Nuublesin ollessa kiireinen ei kaikkia ominaisuuksia ole myöskään ehditty toteuttaa, mutta saapuvat ajan kanssa. Creative ja Hub lisätään myöhemmin, jotka BungeeCordin ansiosta toteutuvat omina palvelimina. Pähkinänkuoressa tämä tarkoittaa sitä, että voitte jatkaa rauhassa Survivalin pelaamista, jos Gauris kaataa Creativen sillä välin.</p>\n<p>Suunnitelmissa on myös Skyblockin ja minipelien tuominen takaisin, kukin omina versioinaan kunhan aikaa ensin löytyy. Survivalin päämuutoksiin tulevaisuudessa kuuluu ekonomian muuttaminen ja tasapainottaminen, pelimuodon vaikeuttaminen itsessään, sekä mahdollisesti pelaajien omat suojaukset. Jälkimmäisestä ei ole mitään varmuutta.</p>\n<p>Nettisivut saivat myös hieman ehostusta ympäri sivustoa. Vanha muutosloki on dumpattu ja tilalle luotu loki 1.14 versiota koskevia muutoksia varten.</p>\n<p><strong>Muistutuksen arvoisia asioita tähän loppuun:</strong> Karanteeni hakee edelleen uutta ja aktiivista ylläpitoa, nettisivu saattaa sisältää vanhaa tietoa ja palvelimen IP-osoite on vaihtunut.</p>\n<p>Ystävällisin terveisin,\nKaranteenin ylläpito</p>\n","title":"Villages and pillages","date":"2019-04-22","type":"Päivitys"},"otherPosts":[{"id":"1.17","title":"1.17.1","date":"2021-07-11","type":"Ilmoitus"},{"id":"kesa_lahestyy_2021","title":"Kesä lähestyy","date":"2021-05-10","type":"Ilmoitus"},{"id":"paasiainen_2021","title":"Pääsiäinen","date":"2021-03-31","type":"Ilmoitus"},{"id":"moderni_maailma","title":"Moderni maailma","date":"2021-03-21","type":"Ilmoitus"},{"id":"teemapaiva","title":"Teemapäivä","date":"2020-12-05","type":"Päivitys"},{"id":"kirahvinpaa","title":"Kirahvinpää","date":"2020-11-07","type":"Päivitys"}]},"__N_SSG":true}