[
    {
        "heading": "Palvelimen laajuiset säännöt",
        "ruleset": [
            {
                "short": "Hack-clientit ovat kiellettyjä",
                "long": "Huijausohjelmien (esim. Xray) käyttäminen on kiellettyä.",
                "icon": "denied"
            },
            {
                "short": "Bugien hyväksikäyttö on kiellettyä",
                "long": "Bugien tai palvelinvirheiden hyväksikäyttö on ankarasti kiellettyä. Mikäli löydät peliä rikkovan bugin tai virheen, voidaan sinua palkita peliajalla.",
                "icon": "denied"
            },
            {
                "short": "Modit ovat kiellettyjä",
                "long": "Pelin etenemistä edistävien modien käyttäminen (esim. schematica) on kiellettyä.",
                "icon": "denied"
            },
            {
                "short": "OptiFine & Sodium",
                "long": "OptiFinen ja Sodiumin kaltaiset suoritustehoa parantavat modit ovat sallittuja.",
                "icon": "allowed"
            },
            {
                "short": "TNT-monistajat ovat osittain sallittuja",
                "long": "TNT-duplikaattoreita voi käyttää hyödyksi farmaamisessa. Kuitenkin muu käyttö on yhä toistaiseksi kielletty.",
                "icon": "notice"
            },
            {
                "short": "Asiattoman skinin tai käyttäjänimen käyttäminen on kiellettyä",
                "long": " Jos nimesi tai skinisi on rasistinen, alatyylinen, loukkaava, tai muuten asiaton, sinua pyydetään vaihtamaan se. Muuten käyttäjäsi bannitaan skinin tai nimen vaihdon ajaksi.",
                "icon": "denied"
            },
            {
                "short": "Käyttäjäsi pelinimi on oltava tunnistettavissa asettamastasi nickistä",
                "long": "Komennolla /nick asetettu lempinimi on oltava pelinimeäsi muistuttava ja tunnistettavissa.",
                "icon": "notice"
            },
            {
                "short": "Alt-accounttien hyväksikäyttäminen kielletty",
                "long": "Et saa käyttää alt-accountteja pääkäyttäjän edun hyväksi (esimerkiksi rahan siirtämistä, tai rankkien ominaisuuksien jakamista).",
                "icon": "denied"
            },
            {
                "short": "Afkaaminen kielletty",
                "long": "Palvelimella afkaaminen on kielletty. \"Afki\"koneiden rakentaminen tästä syystä myös ankarasti kielletty. Mobifarmeilla afkaaminen keräten mobeja on myös kiellettyä. Kuitenkin automaattiset mobifarmit on sallittuja, kunhan entiteettejä ei keräänny liikaa aiheuttaakseen lagia.",
                "icon": "denied"
            },
            {
                "short": "Palvelimen lagittaminen kielletty",
                "long": "Palvelinta rasittavien ja lagittavien redstonerakennelmien teko on kielletty (esim. loputtomiin käyvät kellot, 0-tick farmit). Lisää rakennelmaan sulkemisvipu ja pidä laite suljettuna, jos se ei ole käytössä. Palvelimen lagittamiseen kuuluu myös entiteetit (hostile mobit, lemmikit, kyläläiset).\nYlläpidolla on oikeus tappaa suojauksestasi eläimiä, mikäli ne kuormittavat palvelinta. \nTämän lisäksi teleporttailu matrixin ulkopuolelle (esimerkiksi koordinaatit yli Endin ja Netherin generointirajan, sekä mapin ulkopuolelle jonka rajat ovat +-10k) on kiellettyä. Palvelimen tahallisesta lagittamisesta seuraa aina ikuinen porttikielto.",
                "icon": "denied"
            },
            {
                "short": "Ansaitun rankin hyväksikäyttäminen kielletty",
                "long": "Sinua alempirankkiset pelaajat eivät saa hyötyä rankkisi ominaisuuksista. Et saa esimerkiksi muuntaa spawnerin tyyppiä toisten puolesta, tai myydä spawnereita, joihin pelaajalla ei ole vielä oikeutta.",
                "icon": "denied"
            },
            {
                "short": "Olet velvoitettu ilmoittamaan rikkeestä",
                "long": "Jos havaitset sääntöjen rikkomista, välitä tieto välittömästi ylläpidolle. Pyri hankkimaan todisteita, kuten screenshotteja tai videoita.",
                "icon": "notice"
            }
        ]
    },
    {
        "heading": "Yleiset käytössäännöt",
        "ruleset": [
            {
                "short": "Pidetään keskustelut asiallisena",
                "long": "Muista, että keskustelet oikeiden ihmisten kanssa. Pyritään olemaan mahdollisimman ystävällisiä toisillemme.",
                "icon": "important"
            },
            {
                "short": "Pidetään kieli kurissa",
                "long": "Turha kiroilu ja toisten pelaajien härnäminen tai kiusaaminen ei ole asianmukaista. Ollaanhan ihmisiksi.",
                "icon": "important"
            },
            {
                "short": "Pidetään chatti siistinä",
                "long": "Turha spammaaminen, floodaaminen, ja CAPSILLA KIRJOITTAMINEN on kiellettyä.",
                "icon": "important"
            },
            {
                "short": "Mainostaminen on kiellettyä",
                "long": "Älä mainosta (varsinkaan toisia palvelimia). Tämä ei kuitenkaan tarkoita sitä ettetkö saisi kertoa minkä merkkinen hiiri tai auto sinulla on, mutta siinä se raja sitten kulkeekin.",
                "icon": "denied"
            }
        ]
    },
    {
        "heading": "Survivalin lisäsäännöt",
        "ruleset": [
            {
                "short": "Grieffaaminen on kielletty",
                "long": "Toisten pelaajien rakennelmien tuhoaminen ja omaisuuden varastaminen on kielletty. Mikäli tielläsi on rakennus, pyydä ylläpitoa rikkomaan tai siirtämään sitä.",
                "icon": "denied"
            },
            {
                "short": "Pelaajien vedättäminen, skämmääminen on kiellettyä",
                "long": "Et saa esimerkiksi huijata toiselta tavaraa.",
                "icon": "denied"
            },
            {
                "short": "Maisemagrieffaaminen kielletty",
                "long": "Maaston ja maiseman turmeleminen on kiellettyä. Puut on kasvatettava takaisin, hiekan hakkuu ei saa jättää rumia jälkiä ympäristöön, turhien epäesteettisten rakennelmien rakentaminen on kielletty (esim. 1x1 dirt tornit).",
                "icon": "denied"
            },
            {
                "short": "Villager kyliä ei saa tuhota",
                "long": "Villager kyliä ei saa grieffata, mutta heinäpaalut, työasemat, kellot, sekä sängyt saa ottaa itselleen. Kylien peltoja saa käyttää, kunhan muistaa istuttaa ruoat takaisin. Kylän voi ottaa kodikseen, jolloin kyliä koskevat säännöt eivät enää päde.",
                "icon": "notice"
            },
            {
                "short": "Pelaajien tappaminen ja pelaaja-ansojen rakentaminen kielletty",
                "long": "Et saa aiheuttaa vahinkoa toisiin pelaajiin. Rakennelmat, jotka voivat tappaa pelaajan, ovat ankarasti kiellettyjä.",
                "icon": "denied"
            },
            {
                "short": "Karanteeni on poliittisesti neutraali palvelin",
                "long": "Tämä tarkoittaa sitä, että chatissa ja palvelimella pyritään välttämään poliittisia aatteita, symboleita tai ideologioita. Myös yleistä keskustelua politiikasta pyritään välttämään, koska se yleensä aiheuttaa väittelyitä ja eripuraa.",
                "icon": "denied"
            },
            {
                "short": "Älä rakenna liian lähelle toisia ilman lupaa",
                "long": "Ylläpito suojaa alueen ja suojaukseen vaaditaan talon alku. Huomaathan, että talosi täytyy olla vähintään sadan (100) blockin päässä lähimmästä talosta. Endiin ei pääsääntöisesti suojata alueita.",
                "icon": "notice"
            }
        ]
    },
    {
        "heading": "Pelaajakylien täsmennyssäännöt",
        "ruleset": [
            {
                "short": "Kylän mainostaminen julkisesti",
                "long": "Kylien mainostus on sallittua, mutta jos pelaajat antavat siitä palautetta, täytyy siinä hommassa rauhoittua. Pyynnön ohittamisesta seuraa varoitus. Pyyntöä ei kuitenkaan saa tehdä syyttä, kaikilla on oltava mahdollisuus saada pelaajia kyläänsä.",
                "icon": "notice"
            },
            {
                "short": "Kylän mainostaminen yksityisesti",
                "long": "Kylien mainostus yksityisviestillä on kiellettyä. Tällä vältämme sen, että joku kokee mainostuksen hyökkäävänä. Kyliä saa mainostaa julkisesti pitäen sen rajoissa. (Kts. yllä)",
                "icon": "denied"
            },
            {
                "short": "Copy & Paste viestit ovat kiellettyjä",
                "long": "Copy Paste eli niin sanottu massapostaus on kiellettyä. Kukaan ei jaksa nähdä joka viides minuutti täysin samaa viestiä kylästäsi ja siitä mitä palveluita siellä on. Kokeile sen sijaan mainostaa kylääsi ystävällisesti ja henkilökohtaisesti. Jos joku tarvitsee xp-farmia ja kylässäsi on sellainen, mainitse se ihmeessä.",
                "icon": "denied"
            },
            {
                "short": "Mainosta kylääsi spawnilla!",
                "long": "Jomelle voi yksityisviestillä laittaa 256x128 resoluutioisen kuvan, jossa mainostat omaa kylääsi. Se laitetaan spawnille. Kylällä on oltava warp, jotta mainoksesi laitetaan näkyviin!",
                "icon": "important"
            },
            {
                "short": "Xp-farmit ja /spawner",
                "long": "Kyliin on mahdollista muuttaa spesifi spawner, mutta spawner täytyy palauttaa tai myydä alkuperäisessä mobissa takaisin.",
                "icon": "allowed"
            },
            {
                "short": "Kylästä häätäminen",
                "long": "Kylän omistaja(t) voi(vat) häätää pelaajan sääntörikkomuksen seurauksena. Mikäli kylästä häädetään henkilö, tulee hänen tavaransa palauttaa. Mikäli henkilö poistetaan kylästä ilman, että tavaroita palautetaan asianmukaisessa ajassa, on häätäjä rikkonut serverin sääntöjä (varastaminen).",
                "icon": "notice"
            },
            {
                "short": "Rakennusten purkaminen",
                "long": "Kylän omistajilla on oikeus purkaa rakennuksia kylänsä alueelta, antaen asukkaille asianmukaisessa ajassa ennen sitä ilmoituksen rakennusten purkamisesta (n. viikko). Mikäli puretaan serverillä pelaamisen lopettaneen pelaajan talo, tulee hänen tavaransa siirtää talteen nimettyihin arkkuihin, jotta ne voidaan palauttaa hänelle hänen palatessa servulle. Mikäli talo on pelaajan rakentama, tulee myös taloon käytetyt materiaalit palauttaa.",
                "icon": "important"
            },
            {
                "short": "Maksut / verotus",
                "long": "Kylät voivat vaatia maksua pelaajilta, uhkauksena kylästä häätö. Pelaajilla ei ole kuitenkaan pakotetta maksaa maksuja, eikä heiltä oleteta sitä. Mikäli maksun saanut henkilö ei ole kylän asukas saadessaan maksun, ei hänellä ole velvoitetta maksaa sitä. Kuitenkin kylän omistaja(t) voi(vat) evätä häneltä kylään pääsyn jatkossa.",
                "icon": "important"
            },
            {
                "short": "Asumattomien asukkaiden lisääminen on kiellettyä",
                "long": "Asukkaiden lisääminen, jotka eivät tule asumaan kylässä on ankarasti kiellettyä. Tätä perustellaan sillä, että kylät eivät näytä isommilta, eivätkä pienet kylät saa warppia huijaamalla.",
                "icon": "denied"
            }
        ]
    },
    {
        "heading": "Tietosuoja ja muut",
        "ruleset": [
            {
                "short": "Ylläpito näkee komennot, viestit, ja datan",
                "long": "Turvallisuussyistä ylläpito näkee kaikki pelaajien komennot ja viestit, joilla estetään esimerkiksi toisten häiriköintiä ja mahdollista lähentelyä. Tämä on yleisesti käytössä kaikilla Minecraft-palvelimilla, vaikka he eivät toisikaan sitä esille millään tavalla, näin toimien harmaalla alueella. (esimerkiksi: /socialspy). Vaikka ylläpito näkeekin pelaajan datan kuten muilla palvelimilla, yksityistä tietoa näistä ei levitetä ulkopuolelle, kuten muillakin palvelimilla.",
                "icon": "notice"
            }
        ]
    }
]
